Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Because reference objects are implemented in close cooperation with the garbage collector, this class may not be subclassed directly.
zh_cn: 因为引用对象是通过与垃圾回收器的密切合作来实现的，所以不能直接为此类创建子类。

source: Because some native platforms only provide limited buffer size for standard input and output streams, failure to promptly write the input stream or read the output stream of the subprocess may cause the subprocess to block, or even deadlock.
zh_cn: 因为有些本机平台仅针对标准输入和输出流提供有限的缓冲区大小，如果读写子进程的输出流或输入流迅速出现失败，则可能导致子进程阻塞，甚至产生死锁。

source: Because the ReferenceQueue.poll method simply checks an internal data structure, this check will add little overhead to the hashtable access methods.
zh_cn: 因为 ReferenceQueue.poll 方法仅仅检查内部数据结构，此检查只为哈希表访问方法增加了很小的系统开销。

source: Because the initCause method is public, it allows a cause to be associated with any throwable, even a "legacy throwable" whose implementation predates the addition of the exception chaining mechanism to Throwable.
zh_cn: initCause 方法是公共的，它允许 cause 与任何 throwable 相关联，甚至包括“遗留 throwable”，它的实现提前将异常链机制的附件应用到 Throwable。

source: Because the referent of a phantom reference is always inaccessible, this method always returns null.
zh_cn: 因为虚引用的指示对象总是不可到达的，所以此方法总是返回 null。

source: Because the table uses power-of-two masking, sets of hashes that vary only in bits above the current mask will always collide.
zh_cn: 由于表使用 2 的幂级别的掩码，所以只在当前掩码之上的位上发生变化的散列总是会发生冲突。

source: Being active simply means that a thread has been started and has not yet been stopped.
zh_cn: 激活的意思是说某个线程已启动并且尚未停止。

source: Besides Queues, this package supplies Collection implementations designed for use in multithreaded contexts: ConcurrentHashMap, ConcurrentSkipListMap, ConcurrentSkipListSet, CopyOnWriteArrayList, and CopyOnWriteArraySet.
zh_cn: 除队列外，此包还提供了设计用于多线程上下文中的 Collection 实现：ConcurrentHashMap、ConcurrentSkipListMap、ConcurrentSkipListSet、CopyOnWriteArrayList 和 CopyOnWriteArraySet。

source: Besides accuracy at individual arguments, maintaining proper relations between the method at different arguments is also important.
zh_cn: 除了个别参数的准确性之外，维护不同参数的方法之间的正确关系也很重要。

source: Bins are converted to trees when adding an element to a bin with at least this many nodes.
zh_cn: 将元素添加到 bin 中时，如果 bin 至少包含该数量的结点时，该 bin 将转换为树。

source: Bins of TreeNodes may be traversed and used like any others, but additionally support faster lookup when overpopulated.
zh_cn: TreeNodes 的 bin 可以像任何其他的一样被遍历和使用，但是数量过多时还支持更快的查找。

source: Bits encoding access (e.g.
zh_cn: 比特编码的访问(例如。

source: Bits encoding access (e.g. public, private) as well as other runtime specific flags
zh_cn: 比特编码的访问(例如 public、private)以及其他运行时特定的标志

source: Blocks until all tasks have completed execution after a shutdown request, or the timeout occurs, or the current thread is interrupted, whichever happens first.
zh_cn: 请求关闭、发生超时或者当前线程中断，无论哪一个首先发生之后，都将导致阻塞，直到所有任务完成执行。

source: Both extend class AbstractOwnableSynchronizer, a simple class that helps record the thread currently holding exclusive synchronization.
zh_cn: 两者都扩展了类 AbstractOwnableSynchronizer（一个帮助记录当前保持独占同步的线程的简单类）。

source: Buffers
zh_cn: 缓冲区

source: But ConcurrentHashMap is "concurrent".
zh_cn: 但 ConcurrentHashMap 则是“并发的”。

source: But programmers may create their own implementations to cover nonstandard requirements.
zh_cn: 但程序员可以创建自己的、适用于非标准要求的实现。

source: But the only known cases stem from poor user programming practices that are already so slow that this makes little difference.)
zh_cn: 但是，唯一已知的情况源于糟糕的用户编程实践，这些实践已经非常缓慢，使得几乎没有区别）。

source: But, in most cases, there is no need to deal directly with the subclasses, as the InetAddress abstraction should cover most of the needed functionality.
zh_cn: 但是，在大多数情况下，不必直接处理子类，因为 InetAddress 抽象应该覆盖大多数必需的功能。

source: By convention, class Throwable and its subclasses have two constructors, one that takes no arguments and one that takes a String argument that can be used to produce a detail message.
zh_cn: 根据惯例，Throwable 类及其子类有两个构造方法，一个不带参数，另一个带有 String 参数，此参数可用于生成详细消息。

source: By convention, classes that implement this interface should override Object.clone (which is protected) with a public method.
zh_cn: 按照惯例，实现此接口的类应该使用公共方法重写 Object.clone（它是受保护的）。

source: By convention, the object returned by this method should be independent of this object (which is being cloned).
zh_cn: 按照惯例，此方法返回的对象应该独立于该对象（正被复制的对象）。

source: By convention, the returned object should be obtained by calling super.clone.
zh_cn: 按照惯例，返回的对象应该通过调用 super.clone 获得。

source: By default many of the Math methods simply call the equivalent method in StrictMath for their implementation.
zh_cn: 默认情况下，很多 Math 方法仅调用 StrictMath 中的等价方法来完成它们的实现。

source: By default the protocol handlers are loaded dynamically from the default location.
zh_cn: 默认情况下，协议处理程序从默认位置动态加载。

source: By default, a reflected object is not accessible.
zh_cn: 默认情况下，反射对象 不可 访问。

source: By default, even core threads are initially created and started only when new tasks arrive, but this can be overridden dynamically using method prestartCoreThread() or prestartAllCoreThreads().
zh_cn: 默认情况下，即使核心线程最初只是在新任务到达时才创建和启动的，也可以使用方法 prestartCoreThread() 或 prestartAllCoreThreads() 对其进行动态重写。

source: By default, the created subprocess does not have its own terminal or console.
zh_cn: 默认情况下，创建的子进程没有自己的终端或控制台。

source: By default, the keep-alive policy applies only when there are more than corePoolSize threads, but method allowCoreThreadTimeOut(boolean) can be used to apply this time-out policy to core threads as well, so long as the keepAliveTime value is non-zero.
zh_cn: 默认情况下，保持活动策略只在有多于 corePoolSizeThreads 的线程时应用。但是只要 keepAliveTime 值非 0，allowCoreThreadTimeOut(boolean) 方法也可将此超时策略应用于核心线程。

source: By executing a synchronized instance method of that object.
zh_cn: 通过执行此对象的同步实例方法。

source: By executing the body of a synchronized statement that synchronizes on the object.
zh_cn: 通过执行在此对象上进行同步的 synchronized 语句的正文。

source: By setting corePoolSize and maximumPoolSize the same, you create a fixed-size thread pool.
zh_cn: 如果设置的 corePoolSize 和 maximumPoolSize 相同，则创建了固定大小的线程池。

source: By setting maximumPoolSize to an essentially unbounded value such as Integer.MAX_VALUE, you allow the pool to accommodate an arbitrary number of concurrent tasks.
zh_cn: 如果将 maximumPoolSize 设置为基本的无界值（如 Integer.MAX_VALUE），则允许池适应任意数量的并发任务。

source: By supplying a different ThreadFactory, you can alter the thread's name, thread group, priority, daemon status, etc.
zh_cn: 通过提供不同的 ThreadFactory，可以改变线程的名称、线程组、优先级、守护进程状态，等等。

source: Byte buffers are distinguished in that they can be used as the sources and targets of I/O operations.
zh_cn: 因为字节缓冲区可以用作 I/O 操作的源缓冲区和目标缓冲区，所以可以对它们加以区分。

source: Callback interface to allow validation of objects within a graph.
zh_cn: 允许验证图形中对象的回调接口。

source: Callbacks to allow LinkedHashMap post-actions
zh_cn: 回调允许的 LinkedHashMap 后操作

source: Called by clone and readObject.
zh_cn: 由 clone 和 readObject 调用。

source: Called by the Java Virtual Machine when a thread in this thread group stops because of an uncaught exception, and the thread does not have a specific Thread.UncaughtExceptionHandler installed.
zh_cn: 当此线程组中的线程因为一个未捕获的异常而停止，并且线程没有安装特定 Thread.UncaughtExceptionHandler 时，由 Java Virtual Machine 调用此方法。

source: Called by the garbage collector on an object when garbage collection determines that there are no more references to the object.
zh_cn: 当垃圾回收器确定不存在对该对象的更多引用时，由对象的垃圾回收器调用此方法。

source: Called only from resize; see above discussion about split bits and indices.
zh_cn: 只能从 resize 调用; 请参阅上面关于分割位和索引的讨论。

source: Called only from writeObject, to ensure compatible ordering.
zh_cn: 仅从 writeObject 调用，以确保排序兼容。

source: Calling the instance method of a null object.
zh_cn: 调用 null 对象的实例方法。

source: Calling this method may, but is not required to, affect the value returned by a subsequent call to the capacity() method.
zh_cn: 调用此方法可能影响后续调用 capacity() 方法时返回的值（但不要求如此）。

source: Calls find for root node.
zh_cn: 对根节点调用 find 。

source: Case mapping is based on the Unicode Standard version specified by the Character class.
zh_cn: 大小写映射基于 Character 类指定的 Unicode 标准版。

source: Casts an object to the class or interface represented by this Class object.
zh_cn: 将一个对象强制转换成此 Class 对象所表示的类或接口。

source: Casts this Class object to represent a subclass of the class represented by the specified class object.
zh_cn: 强制转换该 Class 对象，以表示指定的 class 对象所表示的类的一个子类。

source: Causes the current thread to wait until another thread invokes the notify() method or the notifyAll() method for this object, or some other thread interrupts the current thread, or a certain amount of real time has elapsed.
zh_cn: 在其他线程调用此对象的 notify() 方法或 notifyAll() 方法，或者其他某个线程中断当前线程，或者已超过某个实际时间量前，导致当前线程等待。

source: Causes the current thread to wait until another thread invokes the notify() method or the notifyAll() method for this object.
zh_cn: 在其他线程调用此对象的 notify() 方法或 notifyAll() 方法前，导致当前线程等待。

source: Causes the current thread to wait until either another thread invokes the notify() method or the notifyAll() method for this object, or a specified amount of time has elapsed.
zh_cn: 在其他线程调用此对象的 notify() 方法或 notifyAll() 方法，或者超过指定的时间量前，导致当前线程等待。

source: Causes the current thread to wait, if necessary, until the process represented by this Process object has terminated.
zh_cn: 导致当前线程等待，如有必要，一直要等到由该 Process 对象表示的进程已经终止。

source: Causes the currently executing thread to sleep (temporarily cease execution) for the specified number of milliseconds plus the specified number of nanoseconds, subject to the precision and accuracy of system timers and schedulers.
zh_cn: 在指定的毫秒数加指定的纳秒数内让当前正在执行的线程休眠（暂停执行），此操作受到系统计时器和调度程序精度和准确性的影响。

source: Causes the currently executing thread to sleep (temporarily cease execution) for the specified number of milliseconds, subject to the precision and accuracy of system timers and schedulers.
zh_cn: 在指定的毫秒数内让当前正在执行的线程休眠（暂停执行），此操作受到系统计时器和调度程序精度和准确性的影响。

source: Causes this character sequence to be replaced by the reverse of the sequence.
zh_cn: 将此字符序列用其反转形式取代。

source: Causes this thread to begin execution; the Java Virtual Machine calls the run method of this thread.
zh_cn: 使该线程开始执行；Java 虚拟机调用该线程的 run 方法。

source: Changes the daemon status of this thread group.
zh_cn: 更改此线程组的后台程序状态。

source: Changes the name of this thread to be equal to the argument name.
zh_cn: 改变线程名称，使之与参数 name 相同。

source: Changes the priority of this thread.
zh_cn: 更改线程的优先级。

source: Character Encodings
zh_cn: 字符编码

source: Character blocks generally define characters used for a specific script or purpose.
zh_cn: 字符块通常定义用于特定脚本或目的的字符。

source: Character information is based on the Unicode Standard, version 6.0.0.
zh_cn: 字符信息基于 Unicode 标准，版本 6.0.0。

source: Characters are copied from this sequence into the destination character array dst.
zh_cn: 将字符从此序列复制到目标字符数组 dst。

source: Characters from a Readable are made available to callers of the read method via a CharBuffer.
zh_cn: 阅读方法的调用方能够通过 CharBuffer 使用 Readable 中的字符。

source: Characters of the char array str, starting at index offset, are appended, in order, to the contents of this sequence.
zh_cn: 将 char 数组 str 中从索引 offset 开始的字符按顺序追加到此序列。

source: Characters of the argument s, starting at index start, are appended, in order, to the contents of this sequence up to the (exclusive) index end.
zh_cn: 将参数 s 中从索引 start 到索引 end 的字符按顺序追加到此序列。

source: Checked exception thrown to indicate that a string could not be parsed as a URI reference.
zh_cn: 抛出经过检查的指示字符串不能解析为 URI 引用的异常。

source: Checked exceptions need to be declared in a method or constructor's throws clause if they can be thrown by the execution of the method or constructor and propagate outside the method or constructor boundary.
zh_cn: 检查型异常需要在方法或构造函数声明 throws 子句，如果他们可以通过该方法或构造函数的执行被抛出并且在所述方法或构造边界外传播。

source: Class ForkJoinPool provides an Executor primarily designed for processing instances of ForkJoinTask and its subclasses.
zh_cn: 类 ForkJoinPool 提供主要设计用于的 ForkJoinTask 和它的子类处理实例的执行器。

source: Class Object is the root of the class hierarchy.
zh_cn: 类 Object 是类层次结构的根类。

source: Class Throwable encompasses objects that may be thrown by the throw statement.
zh_cn: 类 Throwable 包含了可能由 throw 语句抛出的对象。

source: Class URL represents a Uniform Resource Locator, a pointer to a "resource" on the World Wide Web.
zh_cn: 类 URL 代表一个统一资源定位符，它是指向互联网“资源”的指针。

source: Class LinkedBlockingDeque provides an implementation.
zh_cn: LinkedBlockingDeque 类提供一个实现。

source: Class loaders may typically be used by security managers to indicate security domains.
zh_cn: 类加载器通常由安全管理器使用，用于指示安全域。

source: Class loaders that support concurrent loading of classes are known as parallel capable class loaders and are required to register themselves at their class initialization time by invoking the ClassLoader.registerAsParallelCapable method.
zh_cn: 支持并发加载类的类加载器称为 parallel capable 类加载器，需要在类初始化时通过调用 ClassLoader.registerAsParallelCapable 方法来注册它们自己。

source: Class, interface (including annotation type), or enum declaration
zh_cn: 类、接口（包括注释类型）或枚举声明

source: Classes
zh_cn: 类

source: Classes ClassLoader, Process, ProcessBuilder, Runtime, SecurityManager, and System provide "system operations" that manage the dynamic loading of classes, creation of external processes, host environment inquiries such as the time of day, and enforcement of security policies.
zh_cn: 类 ClassLoader、Process、 ProcessBuilder、Runtime、SecurityManager 和 System 提供了管理类的动态加载、外部进程创建、主机环境查询（比如时间）和安全策略实施等“系统操作”。

source: Classes for formatting and parsing
zh_cn: 用于格式化和分析的类

source: Classes for iteration over text
zh_cn: 用于迭代文本的类

source: Classes for string collation
zh_cn: 用于整理字符串的类

source: Classes in this package, along with java.lang.Class accommodate applications such as debuggers, interpreters, object inspectors, class browsers, and services such as Object Serialization and JavaBeans that need access to either the public members of a target object (based on its runtime class) or the members declared by a given class.
zh_cn: 此包中的类以及 java.lang.Class 可以适应以下应用程序的需要：调试程序、解释程序、对象检查程序、类浏览程序，以及服务（比如，Object Serialization 和 JavaBean，它们需要访问目标对象（基于其运行时类）的公共成员或给定类声明的成员）。

source: Clears this reference object.
zh_cn: 清除此引用对象。

source: Cloning and serialization
zh_cn: 克隆和序列化

source: Code generators are encouraged to use platform-specific native libraries or microprocessor instructions, where available, to provide higher-performance implementations of Math methods.
zh_cn: 建议代码生成器使用特定于平台的本机库或者微处理器指令（可用时）来提供 Math 方法更高性能的实现。

source: Common superclass of exceptions thrown by reflective operations in core reflection.
zh_cn: 通过反射操作核心反射抛出的异常的通用超类。

source: Compares the specified object with this map for equality.
zh_cn: 比较指定对象与此映射的相等性。

source: Compares the two specified double values.
zh_cn: 比较两个指定的 double 值。

source: Compares the two specified float values.
zh_cn: 比较两个指定的 float 值。

source: Compares this Boolean instance with another.
zh_cn: 将此 Boolean 实例与其他实例进行比较。

source: Compares this Constructor against the specified object.
zh_cn: 将此 Constructor 对象与指定的对象进行比较。

source: Compares this Field against the specified object.
zh_cn: 将此 Field 与指定对象比较。

source: Compares this String to another String, ignoring case considerations.
zh_cn: 将此 String 与另一个 String 比较，不考虑大小写。

source: Compares this enum with the specified object for order.
zh_cn: 比较此枚举与指定对象的顺序。

source: Compares this object against the specified object.
zh_cn: 将此对象与指定对象进行比较。

source: Compares this object to the specified object.
zh_cn: 将此对象与指定对象比较。

source: Compares this object with the specified object for order.
zh_cn: 比较此对象与指定对象的顺序。

source: Compares this string to the specified CharSequence.
zh_cn: 将此字符串与指定的 CharSequence 比较。

source: Compares this string to the specified StringBuffer.
zh_cn: 将此字符串与指定的 StringBuffer 比较。

source: Compares this string to the specified object.
zh_cn: 将此字符串与指定的对象比较。

source: Compares two Byte objects numerically.
zh_cn: 在数字上比较两个 Byte 对象。

source: Compares two Character objects numerically.
zh_cn: 根据数字比较两个 Character 对象。

source: Compares two Double objects numerically.
zh_cn: 对两个 Double 对象所表示的数值进行比较。

source: Compares two Float objects numerically.
zh_cn: 比较两个 Float 对象所表示的数值。

source: Compares two Integer objects numerically.
zh_cn: 在数字上比较两个 Integer 对象。

source: Compares two Long objects numerically.
zh_cn: 在数字上比较两个 Long 对象。

source: Compares two Short objects numerically.
zh_cn: 比较两个 Short 对象所表示的数值。

source: Compares two Subset objects for equality.
zh_cn: 比较两个 Subset 对象的相等性。

source: Compares two boolean values.
zh_cn: 比较两个 boolean 值。

source: Compares two byte values numerically.
zh_cn: 在数字上比较两个 byte 值。

source: Compares two char values numerically.
zh_cn: 在数字上比较两个 char 值。

source: Compares two int values numerically.
zh_cn: 在数字上比较两个 int 值。

source: Compares two long values numerically.
zh_cn: 在数字上比较两个 long 值。

source: Compares two short values numerically.
zh_cn: 在数字上比较两个 short 值。

source: Compares two strings lexicographically, ignoring case differences.
zh_cn: 按字典顺序比较两个字符串，不考虑大小写。

source: Compares two strings lexicographically.
zh_cn: 按字典顺序比较两个字符串。

source: Compilers warn when a deprecated program element is used or overridden in non-deprecated code.
zh_cn: 在使用不被赞成的程序元素或在不被赞成的代码中执行重写时，编译器会发出警告。

source: Computes key.hashCode() and spreads (XORs) higher bits of hash to lower.
zh_cn: 计算 key.hashCode() 并将高位散列扩散（XORs）到低位。

source: Computes the child's initial value for this inheritable thread-local variable as a function of the parent's value at the time the child thread is created.
zh_cn: 在创建子线程时，计算这个可继承线程局部变量的子线程的初始值，将该值作为父线程值的一个函数。

source: Computes the remainder operation on two arguments as prescribed by the IEEE 754 standard.
zh_cn: 按照 IEEE 754 标准的规定，对两个参数进行余数运算。

source: Concatenates the specified string to the end of this string.
zh_cn: 将指定字符串连接到此字符串的结尾。

source: Concurrent Collections
zh_cn: 并发集合

source: Condition implementation for a AbstractQueuedLongSynchronizer serving as the basis of a Lock implementation.
zh_cn: 条件执行用于 AbstractQueuedLongSynchronizer 作为 Lock 实现的基础。

source: Condition implementation for a AbstractQueuedSynchronizer serving as the basis of a Lock implementation.
zh_cn: 条件执行用于 AbstractQueuedSynchronizer 作为 Lock 实现的基础。

source: Constants written into the Object Serialization Stream.
zh_cn: 写入 Object Serialization Stream 的常量。

source: Constructor declaration
zh_cn: 构造方法声明

source: Constructor: only used by the Java Virtual Machine.
zh_cn: 构造方法：仅供 Java 虚拟机使用。

source: Constructs a NullPointerException with no detail message.
zh_cn: 构造不带详细消息的 NullPointerException。

source: Constructs a NullPointerException with the specified detail message.
zh_cn: 构造带指定详细消息的 NullPointerException。

source: Constructs a InvocationTargetException with a target exception and a detail message.
zh_cn: 构造带目标异常和详细消息的 InvocationTargetException。

source: Constructs a InvocationTargetException with a target exception.
zh_cn: 构造带目标异常的 InvocationTargetException。

source: Constructs a new Proxy instance from a subclass (typically, a dynamic proxy class) with the specified value for its invocation handler.
zh_cn: 使用其调用处理程序的指定值从子类（通常为动态代理类）构建新的 Proxy 实例。

source: Constructs a new String by decoding the specified array of bytes using the platform's default charset.
zh_cn: 通过使用平台的默认字符集解码指定的 byte 数组，构造一个新的 String。

source: Constructs a new String by decoding the specified array of bytes using the specified charset.
zh_cn: 通过使用指定的 charset 解码指定的 byte 数组，构造一个新的 String。

source: Constructs a new String by decoding the specified subarray of bytes using the platform's default charset.
zh_cn: 通过使用平台的默认字符集解码指定的 byte 子数组，构造一个新的 String。

source: Constructs a new String by decoding the specified subarray of bytes using the specified charset.
zh_cn: 通过使用指定的 charset 解码指定的 byte 子数组，构造一个新的 String。

source: Constructs a new Subset instance.
zh_cn: 构造一个新的 Subset 实例。

source: Constructs a new AnnotationFormatError with the specified cause and a detail message of (cause == null ?
zh_cn: 构造带指定原因和详细消息的新 AnnotationFormatError，该消息为 (cause == null ?

source: Constructs a new AnnotationFormatError with the specified detail message and cause.
zh_cn: 构造带指定详细消息和原因的新 AnnotationFormatError。

source: Constructs a new AnnotationFormatError with the specified detail message.
zh_cn: 构造具有指定详细消息的新 AnnotationFormatError。

source: Constructs a new HashMap with the same mappings as the specified Map.
zh_cn: 构造一个映射关系与指定 Map 相同的新 HashMap。

source: Constructs a new error with null as its detail message.
zh_cn: 构造详细消息为 null 的新错误。

source: Constructs a new error with the specified cause and a detail message of (cause==null ?
zh_cn: 根据指定的原因和 (cause==null ?

source: Constructs a new error with the specified detail message and cause.
zh_cn: 构造带指定详细消息和原因的新错误。

source: Constructs a new error with the specified detail message, cause, suppression enabled or disabled, and writable stack trace enabled or disabled.
zh_cn: 构造带有指定详细消息、cause、suppression 是否启用和写堆栈是否启用的新 error。

source: Constructs a new error with the specified detail message.
zh_cn: 构造带指定详细消息的新错误。

source: Constructs a new exception with null as its detail message.
zh_cn: 构造详细消息为 null 的新异常。

source: Constructs a new exception with the specified cause and a detail message of (cause==null ?
zh_cn: 根据指定的原因和 (cause==null ?

source: Constructs a new exception with the specified detail message and cause.
zh_cn: 构造一个具有指定详细消息和 cause 的新异常。

source: Constructs a new exception with the specified detail message, cause, suppression enabled or disabled, and writable stack trace enabled or disabled.
zh_cn: 构造带有指定详细消息、cause、suppression 是否启用和写堆栈是否启用的新 exception。

source: Constructs a new exception with the specified detail message.
zh_cn: 构造带指定详细消息的新异常。

source: Constructs a new reference-object queue.
zh_cn: 构造一个新的引用对象队列。

source: Constructs a new thread group.
zh_cn: 构造一个新线程组。

source: Constructs a new throwable with null as its detail message.
zh_cn: 构造一个将 null 作为其详细消息的新 throwable。

source: Constructs a new throwable with the specified cause and a detail message of (cause==null ?
zh_cn: 构造一个带指定 cause 和 (cause==null ?

source: Constructs a new throwable with the specified detail message and cause.
zh_cn: 构造带有指定详细消息和 cause 的新 throwable。

source: Constructs a new throwable with the specified detail message, cause, suppression enabled or disabled, and writable stack trace enabled or disabled.
zh_cn: 构造带有指定详细消息、cause、suppression 是否启用和写堆栈是否启用的新 throwable。

source: Constructs a new throwable with the specified detail message.
zh_cn: 构造带指定详细消息的新 throwable。

source: Constructs a newly allocated Byte object that represents the byte value indicated by the String parameter.
zh_cn: 构造一个新分配的 Byte 对象，以表示 String 参数所指示的 byte 值。

source: Constructs a newly allocated Byte object that represents the specified byte value.
zh_cn: 构造一个新分配的 Byte 对象，以表示指定的 byte 值。

source: Constructs a newly allocated Character object that represents the specified char value.
zh_cn: 构造一个新分配的 Character 对象，用以表示指定的 char 值。

source: Constructs a newly allocated Double object that represents the floating-point value of type double represented by the string.
zh_cn: 构造一个新分配的 Double 对象，表示用字符串表示的 double 类型的浮点值。

source: Constructs a newly allocated Double object that represents the primitive double argument.
zh_cn: 构造一个新分配的 Double 对象，它表示基本的 double 参数。

source: Constructs a newly allocated Float object that represents the argument converted to type float.
zh_cn: 构造一个新分配的 Float 对象，它表示转换为 float 类型的参数。

source: Constructs a newly allocated Float object that represents the floating-point value of type float represented by the string.
zh_cn: 构造一个新分配的 Float 对象，它表示用字符串表示的 float 类型的浮点值。

source: Constructs a newly allocated Float object that represents the primitive float argument.
zh_cn: 构造一个新分配的 Float 对象，它表示基本的 float 参数。

source: Constructs a newly allocated Integer object that represents the int value indicated by the String parameter.
zh_cn: 构造一个新分配的 Integer 对象，它表示 String 参数所指示的 int 值。
